#include <L29xDriver.h>
/*************************************************
 * IN1 * отвечает за движение вперёд 1-го канала *
 * ***********************************************
 * IN2 * отвечает за движение назад 1-го канала  *
 * ***********************************************
 * IN3 * отвечает за движение вперёд 2-го канала *
 * ***********************************************
 * IN4 * отвечает за движение назад 2-го канала  *
 *************************************************/
 /************************************
  * При инициализации канала сначала
  *       указывается пин для 
  *   движения вперёд, а потом назад
  ************************************/
//setSpeed задаёт скорость от -255 до 255

Channel1 ch1(5,6);//инициализация 1-го канала
Channel2 ch2(9,10);//инициализация 2-го канала
void setup() {
  Serial.begin(9600);//просто так
}

void loop() {
  ch1.setSpeed(255);
  ch2.setSpeed(-255);
  delay(1000);
  ch1.setSpeed(-255);
  ch2.setSpeed(255);
  delay(1000);
}
